import streamlit as st


st.set_page_config(page_title="CoolStudy 酷学", page_icon="🦜")
st.markdown("# 🦜CoolStudy 酷学")
st.sidebar.markdown("# 🦜CoolStudy 酷学")

st.markdown("""
**CoolStudy** 是一个创新的、基于 Streamlit 的学习辅助工具集合，专门设计用于提升学生的学习体验。
我们的目标是通过集成人工智能（AI）技术，为学生提供一个直观、互动且富有成效的学习环境。


### 特色功能：

- **多学科支持**：CoolStudy 支持数学、历史、科学等多个学科，为学生提供一个全面的学习环境。

- **AI辅助学习**：利用先进的人工智能算法，CoolStudy 可以解答学生的疑问、提供个性化学习建议，并辅助学生掌握复杂的学术概念。

- **交互式学习工具**：我们的工具集包括数学方程求解器、历史事实查询、科学实验模拟等多种功能，都是为了提供一种更具参与感和互动性的学习方式。

- **友好的用户界面**：通过 Streamlit，CoolStudy 拥有一个清晰、易于导航的用户界面，使学习过程既简单又愉快。

### 适用人群：

- **在校学生**：从小学到高中，无论是基础学科还是高级课程，都能从我们的工具中受益。
- **自学者**：为有志于自我提高和终身学习的人士提供支持。
- **教育工作者**：教师和辅导员可以使用我们的工具来增强教学效果和学生参与度。

### 未来展望：

在 CoolStudy，我们致力于不断创新和改进，以满足日益增长的教育需求。我们的愿景是创建一个全面的学习平台，不仅提供知识，更激发学生的好奇心和求知欲。

---

**如果你也有兴趣，欢迎加入 CoolStudy 的项目，开启智能学习新纪元！**

---
""")
